## 7장. 데이터 준비하기: 다듬기, 변형, 병합
180312: p249-

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
df1= DataFrame({'key':['b','b','a','c','a','a','b'],
               'data1': range(7)})

In [3]:
df2= DataFrame({'key':['a','b','d'], 'data2':range(3)})

In [4]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [5]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

### df.merge()

In [6]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [7]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [8]:
pd.merge(df1, df2, on='key', how='inner')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [9]:
pd.merge(df2, df1, on='key', how='inner')

   data2 key  data1
0      0   a      2
1      0   a      4
2      0   a      5
3      1   b      0
4      1   b      1
5      1   b      6

In [12]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [13]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

#### outer
- data2에 0a 하나이니, 2a 0a, 4a 0a, 5a 0a
- outer 니, c도 있고 d도 있고

In [10]:
pd.merge(df1, df2, on='key', how='outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

#### left
c만 있고 d는 없다

In [11]:
pd.merge(df1, df2, on='key', how= 'left')

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

#### right

In [68]:
pd.merge(df1, df2, on= 'key', how= 'right')

   data1 key  data2
0    0.0   b      1
1    1.0   b      1
2    6.0   b      1
3    2.0   a      0
4    4.0   a      0
5    5.0   a      0
6    NaN   d      2

#### 값은 비스므리한데, 컬럼명이 다르다면

In [71]:
df3= DataFrame({'lkey':['b','b','a','c','a','a','b'],
               'data1':range(7)})

In [72]:
df4= DataFrame({'rkey':['a','b','d'],
               'data2':range(3)})

In [73]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [74]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [13]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

### 다 합치기. outer
full outer join

In [14]:
pd.merge(df1, df2, how= 'outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [76]:
pd.merge(df3, df4, left_on= 'lkey', right_on='rkey', how= 'outer')

   data1 lkey  data2 rkey
0    0.0    b    1.0    b
1    1.0    b    1.0    b
2    6.0    b    1.0    b
3    2.0    a    0.0    a
4    4.0    a    0.0    a
5    5.0    a    0.0    a
6    3.0    c    NaN  NaN
7    NaN  NaN    2.0    d

#### 여러 키 합치기

In [15]:
left= DataFrame({'key1': ['foo','foo','bar'],
                'key2':['one','two','one'],
                'lval':[1,2,3]})
right= DataFrame({'key1':['foo','foo','bar','bar'],
                 'key2':['one','one','one','two'],
                 'rval':[4,5,6,7]})

In [16]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [17]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [19]:
pd.merge(left, right, on=['key1','key2'], how= 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [20]:
pd.merge(left, right, on=['key1','key2'], how= 'left')

  key1 key2  lval  rval
0  foo  one     1   4.0
1  foo  one     1   5.0
2  foo  two     2   NaN
3  bar  one     3   6.0

In [21]:
pd.merge(left, right, on=['key1','key2'], how= 'right')

  key1 key2  lval  rval
0  foo  one   1.0     4
1  foo  one   1.0     5
2  bar  one   3.0     6
3  bar  two   NaN     7

#### 겹치는 칼럼이름
??? 겹치면 좋은 거 아닌가? ㄴㄴ 기준 칼럼 말고 나머지

In [22]:
pd.merge(left, right, on= 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [23]:
pd.merge(left, right, on='key1', suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

#### row기준 merge
p255
> ????

In [24]:
left1= DataFrame({'key':['a','b','a','a','b','c'],
                 'value':range(6)})
right1= DataFrame({'group_val':[3.5, 7]},
                 index= ['a','b'])

In [25]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [26]:
right1

   group_val
a        3.5
b        7.0

In [27]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

# p256 부터 '이해'/타자 칠 차례

## df.join()
p258~

## np.concatenate

In [28]:
arr= np.arange(12).reshape((3,4)); arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [30]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [29]:
np.concatenate([arr, arr], axis= 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

## pd.concat

In [34]:
s1= Series([0,1], index= ['a','b'])
s2= Series([2,3,4], index= ['c','d','e'])
s3= Series([5,6], index= ['f','g'])

In [36]:
s1

a    0
b    1
dtype: int64

In [37]:
s2

c    2
d    3
e    4
dtype: int64

In [38]:
s3

f    5
g    6
dtype: int64

In [35]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [39]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

#### 옵션 keys=

In [41]:
print(s1)
print(s2)

a    0
b    1
dtype: int64
c    2
d    3
e    4
dtype: int64

In [40]:
pd.concat([s1,s1,s2], keys=['one','two','three'])

one    a    0
       b    1
two    a    0
       b    1
three  c    2
       d    3
       e    4
dtype: int64

In [42]:
pd.concat([s1,s1,s2], axis=1, keys=['one','two','three'])

   one  two  three
a  0.0  0.0    NaN
b  1.0  1.0    NaN
c  NaN  NaN    2.0
d  NaN  NaN    3.0
e  NaN  NaN    4.0

##### keys 없으면

In [44]:
pd.concat([s1,s1,s2], axis=1)

     0    1    2
a  0.0  0.0  NaN
b  1.0  1.0  NaN
c  NaN  NaN  2.0
d  NaN  NaN  3.0
e  NaN  NaN  4.0

#### ignore_index

In [45]:
df1= DataFrame(np.random.randn(3,4), columns= ['a','b','c','d'])
df2= DataFrame(np.random.randn(2,3), columns= ['b','d','a'])

In [46]:
df1

          a         b         c         d
0  1.029579 -0.413198  0.897030 -0.468090
1 -0.616722  0.427130  1.731785 -0.562387
2  0.164202 -0.328212  0.902045 -0.245976

In [47]:
df2

          b         d         a
0  1.185413  0.643978 -0.401011
1 -0.056755 -0.226671 -1.295794

In [48]:
pd.concat([df1, df2], ignore_index= True)

          a         b         c         d
0  1.029579 -0.413198  0.897030 -0.468090
1 -0.616722  0.427130  1.731785 -0.562387
2  0.164202 -0.328212  0.902045 -0.245976
3 -0.401011  1.185413       NaN  0.643978
4 -1.295794 -0.056755       NaN -0.226671

In [49]:
pd.concat([df1, df2], ignore_index= False)

          a         b         c         d
0  1.029579 -0.413198  0.897030 -0.468090
1 -0.616722  0.427130  1.731785 -0.562387
2  0.164202 -0.328212  0.902045 -0.245976
0 -0.401011  1.185413       NaN  0.643978
1 -1.295794 -0.056755       NaN -0.226671

In [50]:
pd.concat([df1, df2])#, ignore_index= False)

          a         b         c         d
0  1.029579 -0.413198  0.897030 -0.468090
1 -0.616722  0.427130  1.731785 -0.562387
2  0.164202 -0.328212  0.902045 -0.245976
0 -0.401011  1.185413       NaN  0.643978
1 -1.295794 -0.056755       NaN -0.226671

### df1.combine_first(df2)

In [51]:
df1= DataFrame({'a':[1., np.nan, 5., np.nan],
               'b':[np.nan, 2., np.nan, 6.],
               'c': range(2,18,4)})
df2= DataFrame({'a':[5.,4.,np.nan,3.,7.],
               'b':[np.nan, 3.,4.,6.,8.]})

In [52]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [53]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [54]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [55]:
pd.merge(df1, df2, how='outer')

     a    b     c
0  1.0  NaN   2.0
1  NaN  2.0   6.0
2  5.0  NaN  10.0
3  NaN  6.0  14.0
4  4.0  3.0   NaN
5  NaN  4.0   NaN
6  3.0  6.0   NaN
7  7.0  8.0   NaN

In [14]:
s1= Series([0,1], index=['a','b']); s1

a    0
b    1
dtype: int64

In [15]:
s2= Series([2,3,4], index= ['c','d','e']); s2

c    2
d    3
e    4
dtype: int64

In [16]:
s3= Series([5,6], index= ['f','g']); s3

f    5
g    6
dtype: int64

In [18]:
s1, s2, s3

(a    0
 b    1
 dtype: int64, c    2
 d    3
 e    4
 dtype: int64, f    5
 g    6
 dtype: int64)

In [19]:
[s1, s2, s3]

[a    0
 b    1
 dtype: int64, c    2
 d    3
 e    4
 dtype: int64, f    5
 g    6
 dtype: int64]

In [20]:
pd.concat((s1,s2,s3))

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [21]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [22]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [27]:
DataFrame([s1,s2,s3]).T

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [29]:
s1

a    0
b    1
dtype: int64

In [30]:
s3

f    5
g    6
dtype: int64

In [31]:
[s1*5, s3]

[a    0
 b    5
 dtype: int64, f    5
 g    6
 dtype: int64]

In [39]:
s4= pd.concat([s1*5, s3]); s4

a    0
b    5
f    5
g    6
dtype: int64

In [38]:
pd.concat([s1*5, s3], axis=1)

     0    1
a  0.0  NaN
b  5.0  NaN
f  NaN  5.0
g  NaN  6.0

In [41]:
# del s4

In [42]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [43]:
pd.concat([s1, s4], axis=1, join= 'inner')

   0  1
a  0  0
b  1  5

In [44]:
pd.concat([s1, s4], axis=1, join_axes= [['a','c','b','e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN